[
  {
    "lastName": "Ruiz",
    "blazon": "ruiz.png",
    "wiki": "https://es.wikipedia.org/wiki/Ruiz_(apellido)",
    "source": "Wikipedia",
    "description": "El apellido Ruiz se origina en la España medieval. Es un patronímico en toda regla proveniente del nombre germánico Rodrigo (Hrōþ-rīks), cuyo significado es 'Aquel que es rico en gloria y dinero', como 'Loud+Rich' en inglés. Su grafía en la España de la alta y media Edad Media fue Ruy o Rui, de donde viene 'Ruiz' ('hijo de' Ruy si es Yehudi significa Ben David o Hijo del Rey David). Por ser un patronímico de nombre, no posee un origen único, siendo así que se encuentran diversas casas de diferente origen por toda la vertiente norte de la España medieval. El apellido se ha extendido por toda España, América y las regiones que fueron conquistadas y colonizadas por el Imperio Español y aquellos a donde han migrado."
  },
  {
    "lastName": "Sosa",
    "blazon": "sosa.png",
    "wiki": "https://es.wikipedia.org/wiki/Sosa_(apellido)",
    "source": "Wikipedia",
    "description": "Sosa es un apellido de origen luso-castellano. En España, tiene ramificaciones importantes en las poblaciones extremeñas de Don Benito, Guareña y Mérida. Las ramas con origen en Castilla radicaron principalmente en Burgos, León y Madrid. De todas formas, las casas más numerosas se encuentran en las Islas Canarias, en las poblaciones de Las Palmas de Gran Canaria, Agaete, Gáldar, San Agustín, San Nicolás de Tolentino y Santa Brígida. Se puede encontrar también la forma Sousa, procedente de Portugal, que enlazó con descendientes de la Casa Real de Portugal y más tarde con la realeza española, siendo en realidad la variante castellana del apellido portugués (forma original de escribir este apellido: 'Sousa' o 'Souza')."
  },
  {
    "lastName": "Benitez",
    "blazon": "benitez.png",
    "wiki": "https://www.plusesmas.com/genealogia/escudos/benitez/7006/",
    "source": "Plusesmas.com",
    "description": "De origen asturiano. Es un apellido antiguo, aunque no es posible establecer con exactitud cuándo apareció. Con la Reconquista, se extendió por toda la Península, especialmente en Extremadura y Andalucía. Es uno de los 100 apellidos más frecuentes en España. Es un patronímico de Benito, con el sufijo castellano ez: 'hijo de'. Viene del latín bene dictus: 'bendito'."
  },
  {
    "lastName": "Romero",
    "blazon": "romero.png",
    "wiki": "https://es.wikipedia.org/wiki/Romero_(apellido)",
    "source": "Wikipedia",
    "description": "El apellido procede de la región mediterránea. Hay diversas historias acerca de este antropónimo. Una conjetura digna de atención considera que, de camino a la Tierra Santa, muchos viajeros se trasladaban desde el Imperio romano de Occidente al de Oriente, y que los habitantes del Imperio bizantino habrían dado el sobrenombre de 'Romero' a los peregrinos que llegaban desde Roma (entendiérase por tal la capital o el imperio). En cuanto a la planta, su nombre latino, rosmarinus, significa 'rocío marino'. Es conocida por su olor penetrante y por sus virtudes medicinales, entre ellas el refuerzo de la memoria. Esta hierba parece aguantar tanto la lluvia fuerte como los períodos largos de sequía. Además, es muy resistente a las plagas. A menudo, las familias que recibían el sobrenombre de 'Romero' eran tenidas como gente muy capaz de soportar la adversidad y el sufrimiento, virtudes de los mártires."
  },
  {
    "lastName": "Rodriguez",
    "blazon": "rodriguez.png",
    "wiki": "https://es.wikipedia.org/wiki/Rodríguez",
    "source": "Wikipedia",
    "description": "Su origen es patronímico, de la unión de Rodrigo y el sufijo «-ez», que al final de este y de otros tantos apellidos españoles, significa «hijo de». El nombre Rodrigo, es de origen proto-germánico latinizado como Roderici, *hrōþiz 'fama' + *rīks 'rey, gobernador'. El sufijo desconocido, solo se sabe que es prerrománico. El significado del apellido sería 'hijo de Rodrigo' o 'hijo del rey famoso'."
  },
  {
    "lastName": "Zambrano",
    "blazon": "zambrano.png",
    "wiki": "https://www.plusesmas.com/genealogia/escudos/zambrano/51799/",
    "source": "Plusesmas.com",
    "description": "No se tiene un origen exacto, aunque la mayoría de expertos coinciden en que proviene del País Vasco. El apellido Zambrano es un topónimo proveniente de la localidad de Zambrana, en Álava, o de la anteiglesia de Santa María de Zambrana, en Guipúzcoa. Es un apellido que está muy extendido por América, al igual que por otros lugares de pasado histórico español. El apellido se puede encontrar en Italia en las formas derivadas de la original Cambrano y Cembrano."
  },
  {
    "lastName": "Alvarez",
    "blazon": "alvarez.png",
    "wiki": "https://es.wikipedia.org/wiki/Álvarez_(apellido)",
    "source": "Wikipedia",
    "description": "La rama más antigua que se conoce procede de Asturias y posteriormente la de los Álvarez de León que viene de la anterior. Hay, pues, muchas familias de origen y linaje muy distintos y sin ningún vínculo de parentesco que ostentan este apellido, por lo que es gran error suponer como algunos autores, que todos los Álvarez proceden de un mismo y primitivo solar y tronco. Una de las más antiguas es la del linaje de Asturias, o Álvarez de las Asturias. Tuvo su primitivo solar en el concejo de Nava, en el Principado de Asturias. También es muy antigua en Asturias la casa de Álvarez que radicó en la parroquia de Riera, y de la que dimanó la del concejo de Grado. Varios y autorizados tratadistas afirman que estas casas eran originarias de la casa del concejo de Nava, solar del linaje Asturias, y aun cuando no lo prueban, es probable que así fuese, por la semejanza de sus armas y otros datos."
  },
  {
    "lastName": "Acosta",
    "blazon": "acosta.png",
    "wiki": "https://en.wikipedia.org/wiki/Acosta",
    "source": "Wikipedia",
    "description": "Acosta es un apellido español y portugués. Originalmente se utilizaba para referirse a una persona que vivía a la orilla del mar o era de las montañas (costas). Viene de la portuguesa da Costa (coinclusación de la 'costa' inglesa, se traduce literalmente como 'de la costa'), que en español se convirtió en Acosta; la contraparte española exacta de da Costa es 'de la Costa'. Otra de las teorías apunta a un antiquísimo origen romano del apellido, mientras que otras nos llevan hasta un rey godo de nombre Acoista."
  },
  {
    "lastName": "Acosta",
    "blazon": "acosta.png",
    "wiki": "https://en.wikipedia.org/wiki/Acosta",
    "source": "Wikipedia",
    "description": "Acosta es un apellido español y portugués. Originalmente se utilizaba para referirse a una persona que vivía a la orilla del mar o era de las montañas (costas). Viene de la portuguesa da Costa (coinclusación de la 'costa' inglesa, se traduce literalmente como 'de la costa'), que en español se convirtió en Acosta; la contraparte española exacta de da Costa es 'de la Costa'. Otra de las teorías apunta a un antiquísimo origen romano del apellido, mientras que otras nos llevan hasta un rey godo de nombre Acoista."
  }
]